blogs/brower_200_from_disk_cache_vs_304.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-03-15 三 12:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>如何控制浏览器缓存</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">如何控制浏览器缓存</h1>
<p>
WEB开发缓存优化第一原则：缓存离用户越近，性能越高。无疑，浏览器是离用户最近的。那么如何控制浏览器缓存呢？
我以前错误的以为，如果没有显式告知浏览器缓存，那么浏览器就不会缓存，这引起了很大问题。
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Last-Modified</h2>
<div class="outline-text-2" id="text-1">
<p>
如果没有指定 <b>Expires</b> 或 <b>Cache-Control</b> 但是指定了 <b>Last-Modified</b> ，浏览器会猜应该缓存多久。对多数浏览器而言，缓存的时长是 <code>（现在时间 - Last-Modified时间）* 10%</code> 。越老的文件缓存的时间越长。这种控制缓存的方式相当任性，最好显式指定缓存。
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Cache-Control 和 Expires</h2>
<div class="outline-text-2" id="text-2">
<p>
可以通过 <b>Cache-Control</b> 和 <b>Expires</b> 显式的指定缓存。 <b>Cache-Control</b> 的优先级高于 <b>Expires</b> 。 <b>Cache-Control</b> 指定相对时间，而 <b>Expires</b> 指定绝对时间。例如：
</p>
<ol class="org-ol">
<li>Cache-Control: max-age=0                   不缓存</li>
<li>Expires: 0                                 不缓存</li>
<li>Cache-Control: max-age=60                  缓存60S</li>
<li>Expires: Mon, 27 Feb 2017 05:08:53 GMT     在GMT时间2017-2-27 05:08:53过期</li>
</ol>

<p>
除了过期时间，*Cache-Control* 还有其它选项，<a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cache-Control">Cache-Control参考</a>。
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> 200 (from disk cache)、(from memory cache)</h2>
<div class="outline-text-2" id="text-3">
<p>
在chrome开发者工具中会看到 <b>Status 200</b> <b>Size (from disk cache)</b> <b>Size (from memory cache)</b> ，这个的含义是：从浏览器缓存中读取数据，不会真的访问server端。性能最高。
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> 304</h2>
<div class="outline-text-2" id="text-4">
<p>
如果缓存已经过期，会重新请求server端。如果缓存中有 <b>ETag</b> ，那么往server端发请求时会带着 <b>If-None-Match</b> ，值和 <b>ETag</b> 一致。如果缓存中有 <b>Last-Modified</b> ，那么往server端发请求时会带着 <b>If-Modified-Since</b> ，值和 <b>Last-Modified</b> 一致。 <b>If-None-Match</b> 优先级高于 <b>If-Modified-Since</b> ，如果服务端判定缓存仍然有效，返回304。虽然304对服务端有真实的请求，但是响应没有BODY，性能也很高。
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> 实践</h2>
<div class="outline-text-2" id="text-5">
<p>
对于静态资源，推荐的做法是使用版本或签名作为文件名，更改内容时更新版本和签名，这样可以在浏览器端设置很长的过期时间。但是对于html，文件名不应该改变，应该通过减少缓存时间，甚至不设置缓存。
</p>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">6</span> nginx 配置</h2>
<div class="outline-text-2" id="text-6">
<pre class="example">
# cache-control for static resource
set $cache_control "";
if ($uri ~ "\.(?:html|json)$") {
  set $cache_control "public, max-age=0, must-revalidate";
}
if ($uri ~ "\.(?:jpg|jpeg|gif|png|ico|svg|mp4|ttf)$") {   # 100 days
  set $cache_control "public, max-age=8640000";
}
if ($uri ~ "\.(?:css|js)$") {   # 1 day
  set $cache_control "public, max-age=86400";
}
add_header Cache-Control $cache_control;
</pre>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">7</span> 浏览器如何请求资源</h2>
<div class="outline-text-2" id="text-7">
<p>
浏览器请求资源的方式影响缓存的使用（浏览器间有不同），资源分主资源和子资源。直接在地址栏输入的是主资源，主资源自己请求的资源是子资源。看例子， <code>api/test</code> 设置了 <code>Cache-Control: max-age=60,private</code> ，但是没有设置 <b>ETag</b> 和 <b>Last-Modified</b> ， <code>test.html</code> 是静态页面，它包含了 <code>api/test</code> 子资源，另外 <b>XHR</b> 请求也属于子资源请求。
</p>

<ol class="org-ol">
<li><code>http://dev/api/test</code></li>

<li><code>http://dev/test.html</code> 内容是</li>
</ol>
<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #0000ff; font-weight: bold;">script</span> <span style="color: #ffff00;">src</span>=<span style="color: #00ff00;">"http://dev/api/test"</span>&gt;&lt;/<span style="color: #0000ff; font-weight: bold;">script</span>&gt;
&lt;<span style="color: #0000ff; font-weight: bold;">a</span> <span style="color: #ffff00;">href</span>=<span style="color: #00ff00;">"http://dev/api/test"</span>&gt;Test&lt;/<span style="color: #0000ff; font-weight: bold;">a</span>&gt;
</pre>
</div>

<p>
在浏览器的地址栏输入上面的两个地址：其中1没有使用缓存，虽然 <code>api/test</code> 设置了缓存，但是并没有使用（因为是主资源，所以总是发请求，且没有 <b>ETag</b> 和 <b>Last-Modified</b> 所以没有返回304）。2包含了两个资源，再次刷新，test.html 返回304（因为它是主资源，所以总是请求服务端）， <code>api/test</code> 使用缓存（在chrome中）。但是在firefox中 <code>api/test</code> 也没有使用缓存，只有点击Test打开连接时 <code>api/test</code> 才使用了缓存。
</p>

<p>
除了在地址栏输入地址，点击刷新按钮，摁F5，还可以通过 <code>Ctl-F5</code> 强制刷新，此时所有的缓存都被忽略（老版本的IE不支持）。
</p>

<p>
了解这些并没有太多用，但是如果你想测试接口的缓存效果，发现每次刷新都没有使用缓存，可能是浏览器请求资源方式的缘故。
</p>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11"><span class="section-number-2">8</span> Cache-Control 注意事项</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">8.1</span> max-age=0，no-cache，no-store 的区别</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>max-age=0 的意思是缓存，但是不使用它，当从服务端获取资源失败时，可以考虑使用。</li>
<li>no-cache 的意思是缓存，但是不使用它，仅当从服务端返回了304时，才使用。</li>
<li>no-store 的意思是不缓存。</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">8.2</span> private</h3>
<div class="outline-text-3" id="text-8-2">
<p>
private 对浏览器没有太多意义，更多的是针对CDN或充当CDN的nginx之类，它告诉CDN不要缓存此类响应。例如：同一个url，针对cookie中的用户不同，返回不同的内容，应该是private的，此时CDN就不应该缓存。
</p>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">8.3</span> 浏览器请求时带着：max-age=0</h3>
<div class="outline-text-3" id="text-8-3">
<p>
这是告诉CDN不要使用缓存的内容，把请求代理到upstream服务器。
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">9</span> 浏览器之间的差异</h2>
<div class="outline-text-2" id="text-9">
<p>
各家浏览器基于自己对缓存和性能的理解，对缓存的处理不同，以上描述不是对所有浏览器都适用，但没有本质影响。
</p>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">10</span> 参考资料</h2>
<div class="outline-text-2" id="text-10">
<ol class="org-ol">
<li><a href="https://developers.google.com/web/fundamentals/performance/optimizing-content-efficiency/http-caching">Google Developer HTTP 缓存</a></li>
<li><a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Caching">MDN HTTP Caching</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2017-03-15 三 12:34</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
